# SomeGroupInstsBecameEmpty Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..SomeGroupInstsBecameEmpty Property
BuiltInFailures..::..GroupFailures Class See Also
---
Group instances have had all their group members deleted and will also be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SomeGroupInstsBecameEmpty { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SomeGroupInstsBecameEmpty As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SomeGroupInstsBecameEmpty {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace